FKDD_COPY_DIFF_3_2026-02-13/Enums/АСРМ_УровниЛогирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АСРМ_УровниЛогирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/АСРМ_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>АСРМ_НастройкиПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСайтаDSF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьHTTPS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьHTTPS_DSF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючAPI_DSF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинDSF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольDSF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЛогирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АСРМ_УровниЛогирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/АСРМ_Запросы/Ext/Module.bsl
Функция ПолучитьКоличествоСтраницИзОтвета(Запрос,ВариантПараметровПодключения, Портал) Экспорт
	ПараметрыПодключения=АСРМ_ОбщегоНазначенияСерверПовтИсп.ПолучитьПараметрыПодключения(ВариантПараметровПодключения,Портал);
	
	СтрУрл = "https://"+ПараметрыПодключения.Адрес+""+Запрос;

	//<<Павличенко 03.09.19
	  Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
    Иначе
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
    КонецЕсли;
	//HTTP = новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	//HTTP.Option(4, 13056);
	//HTTP.Option(6, Истина);
	//HTTP.Option(12, Истина);
	//HTTP.Open("GET",СтрУрл,False);
	//
	//HTTP.SetRequestHeader("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	//HTTP.SetRequestHeader("Accept", "application/json; charset=utf-8");
	//HTTP.SetRequestHeader("X-AUTOCRM-API", "1");
	//HTTP.SetRequestHeader("Content-Type", "charset=utf-8");
	ТелоЗапроса = "";	
	Заголовки = Новый Соответствие;
    Заголовки.Вставить("Host", ПараметрыПодключения.Адрес);
    Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
    Заголовки.Вставить("Accept", "application/json; charset=utf-8");
    Заголовки.Вставить("Content-Type", "charset=utf-8");
    HTTPЗапрос     = Новый HTTPЗапрос(Запрос,Заголовки);

	//>>Павличенко 03.09.19
	

	НачалоЗапроса=ТекущаяДатаСеанса();	
	Попытка
		//<<Павличенко 03.09.19
		//HTTP.Send();
		Результат      = HTTPСоединение.Получить(HTTPЗапрос);
		//КоличествоСраниц = HTTP.getResponseHeader("X-Pagination-Page-Count");
		КоличествоСраниц = Результат.Заголовки.Получить("X-Pagination-Page-Count");
		//>>Павличенко 03.09.19
		КоличествоСраниц = Число(КоличествоСраниц);
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		//ВызватьИсключение;
		Результат=Неопределено;
	КонецПопытки;

	Возврат КоличествоСраниц;
КонецФункции

Функция КодироватьСтрокуВBase64(ИсходнаяСтрока) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста 	   = Новый ЗаписьТекста(ИмяВременногоФайла);
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	Результат = Base64Строка(Новый ДвоичныеДанные(ИмяВременногоФайла));
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла) ;
	Исключение 
		Сообщить("CRM_ Ошибка обработки пароля в base64!",СтатусСообщения.Внимание);
	КонецПопытки;
	Результат = СтрЗаменить(Результат,"77u/","");
	Возврат Результат;
	
конецфункции

Функция СтрокаВФорматеURL(СтрокаДляКодировки) Экспорт  
	
	//Возврат КодироватьСтроку(СтрокаДляКодировки,СпособКодированияСтроки.КодировкаURL);
	
    Стр	= СтрокаДляКодировки;
    Длина=СтрДлина(Стр);
    Итог="";
    Для Н=1 По Длина Цикл
 	   Знак=Сред(Стр,Н,1);
 	   Код=КодСимвола(Знак);
 
 	   если ((Знак>="a")и(Знак<="z")) или
 			((Знак>="A")и(Знак<="Z")) или
 			((Знак>="0")и(Знак<="9")) тогда
 		   Итог=Итог+Знак;
 	   Иначе
 		   Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
 			   Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
 		   ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
 			   Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
 		   ИначеЕсли (Знак="ё") Тогда
 			   Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
 		   ИначеЕсли (Знак="Ё") Тогда
 			   Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
 		   Иначе
 			   Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
 		   КонецЕсли;
 	   КонецЕсли;
    КонецЦикла;
    Возврат Итог;

 
КонецФункции

Функция ПолучитьСтрокуЗаголовков(Заголовки) 
	СтрокаЗаголовков="";
	
	Для Каждого КлючЗначение Из Заголовки Цикл
		СтрокаЗаголовков=СтрокаЗаголовков+?(ЗначениеЗаполнено(СтрокаЗаголовков),Символы.ПС,"")+КлючЗначение.Ключ+":"+КлючЗначение.Значение;
	КонецЦикла;
	
	Возврат СтрокаЗаголовков;
КонецФункции

Функция ПолучитьКодыУспешногоВыполненияЗапроса() Экспорт
	КодыУспешныхЗапросов=Новый Массив;
	КодыУспешныхЗапросов.Добавить(200);
	КодыУспешныхЗапросов.Добавить(201);
	Возврат КодыУспешныхЗапросов;
КонецФункции

Функция ПроверитьУспешностьВыполненияЗапроса(HTTPответ) Экспорт
	Если HTTPответ=Неопределено Тогда 
		Возврат ложЬ;
	КонецЕсли;
	КодСостояния = HTTPОтвет.КодСостояния;
	КодыУспешныхЗапросов=ПолучитьКодыУспешногоВыполненияЗапроса();
	
	Возврат КодыУспешныхЗапросов.Найти(КодСостояния)<>Неопределено;
	
КонецФункции


Функция ПреобразоватьвСистему(Число10,система)
	
	 Если система > 36 или система < 2 тогда
		 Сообщить("Выбранная система исчисления не поддерживается");
		 Возврат -1;
	 КонецЕсли;
	 
	 СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	 СтрокаСистема = "";
	 Пока Число10 > 0 цикл
		 РезДеления = Число10/система;
		 ЧислоСистема = цел(РезДеления);
		 остатокОтДеления = Число10 - система*(ЧислоСистема);
		 СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		 Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	 КонецЦикла;
	 
	 //!!!!!!!!
	 //[
	 Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	 Если Нечётное тогда
		 СтрокаСистема = "0"+СтрокаСистема;
	 КонецЕсли;
	 //]
	 Возврат СтрокаСистема;
 КонецФункции


Процедура ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,ТелоЗапроса,HTTPОтвет,ДатаНачала,ДатаОкончания,HTTPФункция,ВариантПараметровПодключения,СтрУрл)
	ВариантЛогирования=Справочники.АСРМ_НастройкиПодключения.УровеньЛогирования.Значение;
	
	Если ВариантЛогирования=Перечисления.АСРМ_УровниЛогирования.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если HTTPОтвет = Неопределено Тогда 
		Ошибка = Истина;
	Иначе 
		Ошибка=Не ПроверитьУспешностьВыполненияЗапроса(HTTPЗапрос);//.КодСостояния<>КодУспешногоЗапроса;
	КонецЕсли;
	
	Если Не Ошибка И ВариантЛогирования=Перечисления.АСРМ_УровниЛогирования.Ошибки Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЛога=РегистрыСведений.АСРМ_ЛогиЗапросов.СоздатьМенеджерЗаписи();
	ЗаписьЛога.HTTPФункция=HTTPФункция;
	ЗаписьЛога.Сервер=ПараметрыПодключения.Адрес;
	ЗаписьЛога.НачалоЗапроса=ДатаНачала;
	ЗаписьЛога.КонецЗапроса=ДатаОкончания;
	ЗаписьЛога.Идентификатор=Новый УникальныйИдентификатор;
	ЗаписьЛога.Запрос=СтрУрл;
	ЗаписьЛога.ТелоЗапроса=ТелоЗапроса;
	ЗаписьЛога.КодСостояния= ?(HTTPОтвет = Неопределено,300,HTTPОтвет);
	ЗаписьЛога.ИспользоватьHttps=ПараметрыПодключения.ИспользоватьHTTPS;
	ЗаписьЛога.Ошибка=Ошибка;
	ЗаписьЛога.ТелоОтвета=?(HTTPЗапрос = Неопределено,"См. журнал регистрации.",HTTPЗапрос.ПолучитьТелоКакСтроку());
	Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		ЗаписьЛога.ВариантПараметровПодключения=ВариантПараметровПодключения;
	Иначе
		ЗаписьЛога.ВариантПараметровПодключения=Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения];
	КонецЕсли;
	
	ЗаписьЛога.Записать(Истина);	
КонецПроцедуры

//GET Запрос
Функция GETЗапрос(Запрос,ВариантПараметровПодключения,АвторизацияПоАПИ=Ложь, Портал) Экспорт
	ПараметрыПодключения=АСРМ_ОбщегоНазначенияСерверПовтИсп.ПолучитьПараметрыПодключения(ВариантПараметровПодключения,Портал);
    СтрУрл = "https://"+ПараметрыПодключения.Адрес+""+Запрос;
    Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
    Иначе
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
    КонецЕсли;
    ТелоЗапроса = "";
	
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Host", ПараметрыПодключения.Адрес);
    Если АвторизацияПоАПИ Тогда
        Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
    Иначе
        Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
    КонецЕсли;
    Заголовки.Вставить("Accept", "application/json; charset=utf-8");
    Заголовки.Вставить("Content-Type", "charset=utf-8");
    HTTPЗапрос     = Новый HTTPЗапрос(Запрос,Заголовки);
    НачалоЗапроса=ТекущаяДатаСеанса();    
    Попытка
        Результат      = HTTPСоединение.Получить(HTTPЗапрос);
    Исключение
        // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
        Сообщить("_ Произошла сетевая ошибка!");
        Сообщить(ОписаниеОшибки());
        //ВызватьИсключение;
        Результат=Неопределено;
    КонецПопытки;
    КонецЗапроса=ТекущаяДатаСеанса();
	ЗафиксироватьЛогЗапроса(ПараметрыПодключения,Результат,ТелоЗапроса,Результат.КодСостояния,НачалоЗапроса,КонецЗапроса,"GET",ВариантПараметровПодключения,СтрУрл);
    
    Возврат Результат;

КонецФункции

//POST запрос
Функция POSTЗапрос(Запрос,ТелоЗапроса,ВариантПараметровПодключения,АвторизацияПоАПИ=Ложь, Портал) Экспорт
	
	ПараметрыПодключения=АСРМ_ОбщегоНазначенияСерверПовтИсп.ПолучитьПараметрыПодключения(ВариантПараметровПодключения, Портал);
	СтрУрл = "https://"+ПараметрыПодключения.Адрес+""+Запрос;
    Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
    Иначе
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
    КонецЕсли;
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Host", ПараметрыПодключения.Адрес);
    Если АвторизацияПоАПИ Тогда
        Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
    Иначе
        Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
    КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	//Заголовки.Вставить("Content-Type", "charset=utf-8");
    HTTPЗапрос     = Новый HTTPЗапрос(Запрос,Заголовки);
	НачалоЗапроса=ТекущаяДатаСеанса();    
	Попытка
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
		Результат      = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
    Исключение
        // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
        Сообщить("_ Произошла сетевая ошибка!");
        Сообщить(ОписаниеОшибки());
        //ВызватьИсключение;
        Результат=Неопределено;
	КонецПопытки;
	КонецЗапроса=ТекущаяДатаСеанса();
   // ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,             НачалоЗапроса,КонецЗапроса,"GET",ВариантПараметровПодключения);
	ЗафиксироватьЛогЗапроса(ПараметрыПодключения,Результат,ТелоЗапроса,Результат.КодСостояния,НачалоЗапроса,КонецЗапроса,"POST",ВариантПараметровПодключения,СтрУрл);
    
    Возврат Результат;
КонецФункции


//PUT запрос
Функция PUTЗапрос(Запрос,ТелоЗапроса,ВариантПараметровПодключения,АвторизацияПоАПИ=Ложь, Портал) Экспорт
	
	ПараметрыПодключения=АСРМ_ОбщегоНазначенияСерверПовтИсп.ПолучитьПараметрыПодключения(ВариантПараметровПодключения, Портал);
	СтрУрл = "https://"+ПараметрыПодключения.Адрес+""+Запрос;
	
	Если ПараметрыПодключения.ИспользоватьHTTPS Тогда
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес,,,,,,Новый ЗащищенноеСоединениеOpenSSL,Ложь);
    Иначе
        HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.Адрес);
    КонецЕсли;
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Host", ПараметрыПодключения.Адрес);
	
	Если АвторизацияПоАПИ Тогда
		Заголовки.Вставить("Authorization", "Bearer " + ПараметрыПодключения.КлючAPI);
	иначе
		Заголовки.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(ПараметрыПодключения.Логин + ":" + ПараметрыПодключения.Пароль));
	КонецЕсли;
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Connection", "Keep-Alive");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	//	
	//Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	//Заголовки.Вставить("Content-Type", "charset=utf-8");
	

	HTTPЗапрос     = Новый HTTPЗапрос(Запрос,Заголовки);
	
	НачалоЗапроса=ТекущаяДатаСеанса();    
	Попытка
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
        Результат      = HTTPСоединение.Записать(HTTPЗапрос);
    Исключение
        // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
        Сообщить("_ Произошла сетевая ошибка!");
        Сообщить(ОписаниеОшибки());
        //ВызватьИсключение;
        Результат=Неопределено;
	КонецПопытки;
	КонецЗапроса=ТекущаяДатаСеанса();
   // ЗафиксироватьЛогЗапроса(ПараметрыПодключения,HTTPЗапрос,Результат,             НачалоЗапроса,КонецЗапроса,"GET",ВариантПараметровПодключения);
	ЗафиксироватьЛогЗапроса(ПараметрыПодключения,Результат,ТелоЗапроса,Результат.КодСостояния,НачалоЗапроса,КонецЗапроса,"PUT",ВариантПараметровПодключения,СтрУрл);
    
    Возврат Результат;
	
КонецФункции
